"""
Функции, необходимые для модуля matchups_lineups:

- lineups_stats - функция для расчёта показателей классической статистики лайнапа (от 1 до 5 человек)

- lineups_stats_vs_lineups - функция для расчёта показателей классической статистики лайнапа (от 1 до 5 человек)
против лайнапа противника (от 1 до 5 человек).

- lineups_on_off - функция для расчёта процентных показателей (точность бросков) и плюс-минуса, когда
лайнап (от 1 до 5 человек) на площадке и нет.

- lineups_on_off_vs_lineups - функция для расчёт процентных показателей (точность бросков) и плюс-минуса, когда
лайнап (от 1 до 5 человек) играет против лайнапа противника (от 1 до 5 человек) и против других лайнапов.
"""

# import nba_on_court as noc
#
# def f(x):
#     try:
#         noc.players_on_court(5)
#     except Exception:
#         pass
#     finally:
#         v = x + 5
#     return v
#
#
# if __name__ == "__main__":
#     print(f(2))
